#!/bin/bash


#
# инциализация
#
FN="./imp2.log"; [[ -f "$FN" ]] && true > "$FN"
pi="3.14"
f1="10" # частота первой гармоники
fd="1000" # частота дискретизации
w1="2*$pi*$f1/$fd" # относительная круговая частота первой гармоники
a1="4/$pi" # амплитуда первой гармоники


t=0


for i in $(seq 0 1 100); do
   x_sum=2
   for jj in $(seq 1 2 27); do
    xi=$( bc -l <<< "scale=11; (1/($jj))*s($jj*$w1*$t)" ); #echo "xi=$xi"
    x_sum=$( bc -l <<< "scale=11; $x_sum+$a1*($xi)" ); #echo "x_sum=$x_sum"; 
    #x1="(1/1)*s($w1*$t)"
    #x3="(1/3)*s(3*$w1*$t)" 
    #x5="(1/5)*s(5*$w1*$t)" 
    #x7="(1/7)*s(7*$w1*$t)" 
    #x9="(1/9)*s(9*$w1*$t)" 
    #x_sum=$( bc -l <<< "scale=11; 2+$a1*($x1+$x3+$x5+$x7+$x9)" ) # сумма гармоник
    done
    echo "$t, $x_sum" >>  "$FN"
    let t=t+1



done





